tutorials/coolingSphere/constant/fluid/faMesh/faceLabels
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    location    "constant/faMesh";
    object      faceLabels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


12184
(
749022
749023
749024
749025
749026
749027
749028
749029
749030
749031
749032
749033
749034
749035
749036
749037
749038
749039
749040
749041
749042
749043
749044
749045
749046
749047
749048
749049
749050
749051
749052
749053
749054
749055
749056
749057
749058
749059
749060
749061
749062
749063
749064
749065
749066
749067
749068
749069
749070
749071
749072
749073
749074
749075
749076
749077
749078
749079
749080
749081
749082
749083
749084
749085
749086
749087
749088
749089
749090
749091
749092
749093
749094
749095
749096
749097
749098
749099
749100
749101
749102
749103
749104
749105
749106
749107
749108
749109
749110
749111
749112
749113
749114
749115
749116
749117
749118
749119
...
)


// ************************************************************************* //
