tutorials/coolingSphere/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default					backward;
}

gradSchemes
{
    default         		leastSquares;
}

divSchemes
{
    default         		none;
    div(phi,U)              Gauss upwind;
    div(phi,T)              Gauss linearUpwind Gauss linear;
}

laplacianSchemes
{
    default         		Gauss linear corrected;
}

interpolationSchemes
{
    default         		linear;
}

snGradSchemes
{
    default         		corrected;
}

fluxRequired
{
    default         no;
    T;
    p;
    pcorr;
}

// ************************************************************************* //
